app/controllers/api/v1/authors_controller.rb

INSERT INTO "authors" ("names", "created_at", "updated_at") VALUES (?, ?, ?)  [["names", "[]"], ["created_at", "2019-10-21 13:42:57.315663"], ["updated_at", "2019-10-21 13:42:57.315663"]]
---
      def create
        @authors = Author.new
        @authors.names = @authors.format_names(author_params[:names_total], author_params[:names])

        if @authors.save